## Staging: dynamodb
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.vault must be replaced
-/+ resource "aws_dynamodb_table" "vault" {
      ~ arn              = "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault" -> (known after apply)
      ~ id               = "Vault" -> (known after apply)
        name             = "Vault"
      ~ range_key        = "SubmissionID" -> "NAME_OR_CONF" # forces replacement
      ~ read_capacity    = 0 -> (known after apply)
      ~ stream_arn       = "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault/stream/2022-02-16T13:36:10.033" -> (known after apply)
      ~ stream_label     = "2022-02-16T13:36:10.033" -> (known after apply)
        tags             = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ write_capacity   = 0 -> (known after apply)
        # (5 unchanged attributes hidden)

      + attribute {
          + name = "NAME_OR_CONF"
          + type = "S"
        }
      + attribute {
          + name = "RemovalDate"
          + type = "N"
        }
      - attribute {
          - name = "Retrieved" -> null
          - type = "N" -> null
        }
      + attribute {
          + name = "Status"
          + type = "S"
        }
      - attribute {
          - name = "SubmissionID" -> null
          - type = "S" -> null
        }

      + global_secondary_index {
          + hash_key           = "FormID"
          + name               = "Status"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "Status"
        }
      + global_secondary_index {
          + hash_key           = "RemovalDate"
          + name               = "Archive"
          + non_key_attributes = []
          + projection_type    = "ALL"
        }
      - global_secondary_index {
          - hash_key           = "Retrieved" -> null
          - name               = "retrieved-index" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
        }

      ~ ttl {
          + attribute_name = (known after apply)
          ~ enabled        = false -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ dynamodb_vault_arn        = "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault" -> (known after apply)
  ~ dynamodb_vault_stream_arn = "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault/stream/2022-02-16T13:36:10.033" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
